SVM/documentation.org
#+TITLE: Support Vector Machines
#+AUTHOR: Tooraj Taraz
#+OPTIONS: ^:nil _:nil tex:t
#+SETUPFILE: ~/.doom.d/retro-dark.theme

* How the script works?
** Libraries
Similar to what I utilized for previous projects, I've used scikit for this project as well, and a util script used for loading MNIST library.
First 4 lines are only for handling project structure! (Up to this point almost everything is identical to previous projects)
#+BEGIN_SRC python
from pathlib import Path
import sys
path = str(Path(Path(__file__).parent.absolute()).parent.absolute())
sys.path.insert(0, path)
from mnist_utils.util import _x, _y, _y_int, _a, _b_int
from sklearn import svm
from sklearn.metrics import accuracy_score, adjusted_rand_score
from tabulate import tabulate
import math
import numpy as np
import random as rn
import time
#+END_SRC

** Functions
1. learn : This function initializes the support vector classifier with different parameters and is used in the main pipeline, as it took unreasonably long time to train on the whole dataset, I tried training it on a subset of size 10000!
#+BEGIN_SRC python
def learn(decision_function_shape="ovo", kernel="linear", max_iter=1):
    svm_classifier = svm.SVC(decision_function_shape=decision_function_shape, kernel=kernel, max_iter=max_iter)
    svm_classifier.fit(_x[:10000], _y_int[:10000])
    return svm_classifier
#+END_SRC

2. test_accuracy : this function simply measures purity and random index score on training data set and test data set
#+BEGIN_SRC python
def test_accuracy(trained_svm):
    test1 = accuracy_score(_b_int, trained_svm.predict(_a))
    train1 = accuracy_score(_y_int, trained_svm.predict(_x))

    test2 = adjusted_rand_score(_b_int, trained_svm.predict(_a))
    train2 = adjusted_rand_score(_y_int, trained_svm.predict(_x))
    return test1, train1, test2, train2
#+END_SRC

* How it works?
Support Vector Machines try to find a line that divides a dateset into two subsets, in a way that the margin is maximized; in other words they try to solve an optimization problem solving for maximized margin. Although they are great at doing what they do, binary classifications, there are not enough for most applications if they are left as they are, in order to classify data into more that two sets we need to use one of these methodes:
1. one-versus-one
2. one-versus-rest
There is one more  catch to it, it tries to find a **line**, a straight one! And that's not always good, what if the dataset isn't linearly separable? In situations like this we can map data to a higher dimension and try to find a plane that does the job, or we can use a non-linear kernel.
scikit provides us with multiple kernels, here are the ones of used in the main pipeline:
1. poly
2. rbf: These radial basis functions are from C ∞ ( R ) and are strictly positive definite functions. Such as Gaussian function :
\[
  X \sim \mathcal{N}(\mu,\,\sigma^{2})\,.
\]
3. linear
#+BEGIN_SRC python
def pipeline(max_iter_max=100, max_iter_coe=3):
    max_iter = 1
    kernels = ["linear", "rbf", "poly"]
    decision_function_shapes = ["ovo", "ovr"]
    result = []
    while max_iter <= max_iter_max:
        for k in kernels:
            for d in decision_function_shapes:
                print("Trying with max_iter = ", max_iter, " kernel = ", k, " decision_function_shape = ", d)
                svc = learn(d, k, max_iter)
                test1, train1, test2, train2 = test_accuracy(svc)
                result.append([max_iter, k, d, test1, train1, test2, train2])

        max_iter *= max_iter_coe
        if max_iter >= max_iter_max:
            max_iter = -1
        if max_iter == -1:
            break

    print(tabulate(result, headers=['max_iter', 'kernel', 'shape', "TEST_P", "TRAIN_P", "TEST_RI", "TRAIN_RI"]))
#+END_SRC

