SVM/documentation.html
<?xml version="1.0" encoding="utf-8"?>
<!DOCTYPE html PUBLIC "-//W3C//DTD XHTML 1.0 Strict//EN"
"http://www.w3.org/TR/xhtml1/DTD/xhtml1-strict.dtd">
<html xmlns="http://www.w3.org/1999/xhtml" lang="en" xml:lang="en">
<head>
<!-- 2021-11-26 Fri 20:27 -->
<meta http-equiv="Content-Type" content="text/html;charset=utf-8" />
<meta name="viewport" content="width=device-width, initial-scale=1" />
<title>Support Vector Machines</title>
<meta name="author" content="Tooraj Taraz" />
<meta name="generator" content="Org Mode" />
</head>
<body>
<div id="content" class="content">
<h1 class="title">Support Vector Machines</h1>
<div id="table-of-contents" role="doc-toc">
<h2>Table of Contents</h2>
<div id="text-table-of-contents" role="doc-toc">
<ul>
<li><a href="#org7610475">1. How the script works?</a>
<ul>
<li><a href="#org07d87f5">1.1. Libraries</a></li>
<li><a href="#org45047ac">1.2. Functions</a></li>
</ul>
</li>
<li><a href="#orgc3c5350">2. How it works?</a></li>
<li><a href="#org6916c7a">3. Results</a></li>
</ul>
</div>
</div>

<div id="outline-container-org7610475" class="outline-2">
<h2 id="org7610475"><span class="section-number-2">1.</span> How the script works?</h2>
<div class="outline-text-2" id="text-1">
</div>
<div id="outline-container-org07d87f5" class="outline-3">
<h3 id="org07d87f5"><span class="section-number-3">1.1.</span> Libraries</h3>
<div class="outline-text-3" id="text-1-1">
<p>
Similar to what I utilized for previous projects, I&rsquo;ve used scikit for this project as well, and a util script used for loading MNIST library.
First 4 lines are only for handling project structure! (Up to this point almost everything is identical to previous projects)
</p>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">from</span> pathlib <span style="color: #51afef;">import</span> Path
<span style="color: #51afef;">import</span> sys
<span style="color: #dcaeea;">path</span> = <span style="color: #c678dd;">str</span>(Path(Path(__file__).parent.absolute()).parent.absolute())
sys.path.insert(<span style="color: #da8548; font-weight: bold;">0</span>, path)
<span style="color: #51afef;">from</span> mnist_utils.util <span style="color: #51afef;">import</span> _x, _y, _y_int, _a, _b_int
<span style="color: #51afef;">from</span> sklearn <span style="color: #51afef;">import</span> svm
<span style="color: #51afef;">from</span> sklearn.metrics <span style="color: #51afef;">import</span> accuracy_score, adjusted_rand_score
<span style="color: #51afef;">from</span> tabulate <span style="color: #51afef;">import</span> tabulate
<span style="color: #51afef;">import</span> math
<span style="color: #51afef;">import</span> numpy <span style="color: #51afef;">as</span> np
<span style="color: #51afef;">import</span> random <span style="color: #51afef;">as</span> rn
<span style="color: #51afef;">import</span> time
</pre>
</div>
</div>
</div>

<div id="outline-container-org45047ac" class="outline-3">
<h3 id="org45047ac"><span class="section-number-3">1.2.</span> Functions</h3>
<div class="outline-text-3" id="text-1-2">
<ol class="org-ol">
<li>learn : This function initializes the support vector classifier with different parameters and is used in the main pipeline, as it took unreasonably long time to train on the whole dataset, I tried training it on a subset of size 10000!</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">learn</span>(decision_function_shape=<span style="color: #98be65;">"ovo"</span>, kernel=<span style="color: #98be65;">"linear"</span>, max_iter=<span style="color: #da8548; font-weight: bold;">1</span>):
    <span style="color: #dcaeea;">svm_classifier</span> = svm.SVC(decision_function_shape=decision_function_shape, kernel=kernel, max_iter=max_iter)
    svm_classifier.fit(_x[:<span style="color: #da8548; font-weight: bold;">10000</span>], _y_int[:<span style="color: #da8548; font-weight: bold;">10000</span>])
    <span style="color: #51afef;">return</span> svm_classifier
</pre>
</div>

<ol class="org-ol">
<li>test_accuracy : this function simply measures purity and random index score on training data set and test data set</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">test_accuracy</span>(trained_svm):
    <span style="color: #dcaeea;">test1</span> = accuracy_score(_b_int, trained_svm.predict(_a))
    <span style="color: #dcaeea;">train1</span> = accuracy_score(_y_int, trained_svm.predict(_x))

    <span style="color: #dcaeea;">test2</span> = adjusted_rand_score(_b_int, trained_svm.predict(_a))
    <span style="color: #dcaeea;">train2</span> = adjusted_rand_score(_y_int, trained_svm.predict(_x))
    <span style="color: #51afef;">return</span> test1, train1, test2, train2
</pre>
</div>
</div>
</div>
</div>

<div id="outline-container-orgc3c5350" class="outline-2">
<h2 id="orgc3c5350"><span class="section-number-2">2.</span> How it works?</h2>
<div class="outline-text-2" id="text-2">
<p>
Support Vector Machines try to find a line that divides a dateset into two subsets, in a way that the margin is maximized; in other words they try to solve an optimization problem solving for maximized margin. Although they are great at doing what they do, binary classifications, there are not enough for most applications if they are left as they are, in order to classify data into more that two sets we need to use one of these methodes:
</p>
<ol class="org-ol">
<li>one-versus-one</li>
<li>one-versus-rest</li>
</ol>
<p>
There is one more  catch to it, it tries to find a <b><b>line</b></b>, a straight one! And that&rsquo;s not always good, what if the dataset isn&rsquo;t linearly separable? In situations like this we can map data to a higher dimension and try to find a plane that does the job, or we can use a non-linear kernel.
scikit provides us with multiple kernels, here are the ones of used in the main pipeline:
</p>
<ol class="org-ol">
<li>poly</li>
<li>rbf: These radial basis functions are from C ∞ ( R ) and are strictly positive definite functions. Such as Gaussian function :</li>
</ol>
<p>
\[
  X \sim \mathcal{N}(\mu,\,\sigma^{2})\,.
\]
</p>
<ol class="org-ol">
<li>linear</li>
</ol>
<div class="org-src-container">
<pre class="src src-python"><span style="color: #51afef;">def</span> <span style="color: #c678dd;">pipeline</span>(max_iter_max=<span style="color: #da8548; font-weight: bold;">100</span>, max_iter_coe=<span style="color: #da8548; font-weight: bold;">3</span>):
    <span style="color: #dcaeea;">max_iter</span> = <span style="color: #da8548; font-weight: bold;">1</span>
    <span style="color: #dcaeea;">kernels</span> = [<span style="color: #98be65;">"linear"</span>, <span style="color: #98be65;">"rbf"</span>, <span style="color: #98be65;">"poly"</span>]
    <span style="color: #dcaeea;">decision_function_shapes</span> = [<span style="color: #98be65;">"ovo"</span>, <span style="color: #98be65;">"ovr"</span>]
    <span style="color: #dcaeea;">result</span> = []
    <span style="color: #51afef;">while</span> max_iter &gt; max_iter_max:
        <span style="color: #51afef;">for</span> k <span style="color: #51afef;">in</span> kernels:
            <span style="color: #51afef;">for</span> d <span style="color: #51afef;">in</span> decision_function_shapes:
                <span style="color: #51afef;">print</span>(<span style="color: #98be65;">"Trying with max_iter = "</span>, max_iter, <span style="color: #98be65;">" kernel = "</span>, k, <span style="color: #98be65;">" decision_function_shape = "</span>, d)
                <span style="color: #dcaeea;">svc</span> = learn(d, k, max_iter)
                <span style="color: #dcaeea;">test1</span>, <span style="color: #dcaeea;">train1</span>, <span style="color: #dcaeea;">test2</span>, <span style="color: #dcaeea;">train2</span> = test_accuracy(svc)
                result.append([max_iter, k, d, test1, train1, test2, train2])

        <span style="color: #dcaeea;">max_iter</span> *= max_iter_coe

    <span style="color: #51afef;">print</span>(tabulate(result, headers=[<span style="color: #98be65;">'max_iter'</span>, <span style="color: #98be65;">'kernel'</span>, <span style="color: #98be65;">'shape'</span>, <span style="color: #98be65;">"TEST_P"</span>, <span style="color: #98be65;">"TRAIN_P"</span>, <span style="color: #98be65;">"TEST_RI"</span>, <span style="color: #98be65;">"TRAIN_RI"</span>]))
</pre>
</div>
</div>
</div>
