SVM/documentation.org
* Results
Actually there is not much to the results, they are exactly what we expect them to be, rbf better than poly and linear and the more iterations we have the higher the accuracy that we get! poly kernels are not as famous in SVMs as they are in natural language processing, even there they have their limitations, they are used in second order because they tend to over fit in higher orders!
+----------+----------+----------+----------+----------+----------+----------+
| max_iter |  kernel  |  shape   |  TEST_P  | TRAIN_P  | TEST_RI  | TRAIN_RI |
+----------+----------+----------+----------+----------+----------+----------+
|    1     |  linear  |   ovo    |  0.4798  | 0.47685  | 0.221493 | 0.219144 |
+----------+----------+----------+----------+----------+----------+----------+
|    1     |  linear  |   ovr    |  0.4798  | 0.47685  | 0.221493 | 0.219144 |
+----------+----------+----------+----------+----------+----------+----------+
|    1     |   rbf    |   ovo    |  0.3985  | 0.39905  | 0.161733 | 0.166375 |
+----------+----------+----------+----------+----------+----------+----------+
|    1     |   rbf    |   ovr    |  0.3985  | 0.39905  | 0.161733 | 0.166375 |
+----------+----------+----------+----------+----------+----------+----------+
|    1     |   poly   |   ovo    |  0.2322  | 0.22295  |0.0105866 |0.00974319|
+----------+----------+----------+----------+----------+----------+----------+
|    1     |   poly   |   ovr    |  0.2322  | 0.22295  |0.0105866 |0.00974319|
+----------+----------+----------+----------+----------+----------+----------+
|    3     |  linear  |   ovo    |  0.5673  | 0.565733 | 0.301706 | 0.296545 |
+----------+----------+----------+----------+----------+----------+----------+
|    3     |  linear  |   ovr    |  0.5673  | 0.565733 | 0.301706 | 0.296545 |
+----------+----------+----------+----------+----------+----------+----------+
|    3     |   rbf    |   ovo    |  0.5649  | 0.567817 | 0.300823 | 0.303718 |
+----------+----------+----------+----------+----------+----------+----------+
|    3     |   rbf    |   ovr    |  0.5649  | 0.567817 | 0.300823 | 0.303718 |
+----------+----------+----------+----------+----------+----------+----------+
|    3     |   poly   |   ovo    |  0.1742  | 0.167583 |0.0114695 |0.0101923 |
+----------+----------+----------+----------+----------+----------+----------+
|    3     |   poly   |   ovr    |  0.1742  | 0.167583 |0.0114695 |0.0101923 |
+----------+----------+----------+----------+----------+----------+----------+
|    9     |  linear  |   ovo    |  0.6429  | 0.65365  | 0.407321 | 0.420937 |
+----------+----------+----------+----------+----------+----------+----------+
|    9     |  linear  |   ovr    |  0.6429  | 0.65365  | 0.407321 | 0.420937 |
+----------+----------+----------+----------+----------+----------+----------+
|    9     |   rbf    |   ovo    |  0.7653  | 0.76735  | 0.568324 | 0.570437 |
+----------+----------+----------+----------+----------+----------+----------+
|    9     |   rbf    |   ovr    |  0.7653  | 0.76735  | 0.568324 | 0.570437 |
+----------+----------+----------+----------+----------+----------+----------+
|    9     |   poly   |   ovo    |  0.2065  | 0.194183 |0.00901324|0.00835075|
+----------+----------+----------+----------+----------+----------+----------+
|    9     |   poly   |   ovr    |  0.2065  | 0.194183 |0.00901324|0.00835075|
+----------+----------+----------+----------+----------+----------+----------+
|    27    |  linear  |   ovo    |  0.8028  | 0.803033 | 0.633213 | 0.632498 |
+----------+----------+----------+----------+----------+----------+----------+
|    27    |  linear  |   ovr    |  0.8028  | 0.803033 | 0.633213 | 0.632498 |
+----------+----------+----------+----------+----------+----------+----------+
|    27    |   rbf    |   ovo    |  0.8877  |  0.886   | 0.77161  | 0.77001  |
+----------+----------+----------+----------+----------+----------+----------+
|    27    |   rbf    |   ovr    |  0.8877  |  0.886   | 0.77161  | 0.77001  |
+----------+----------+----------+----------+----------+----------+----------+
|    27    |   poly   |   ovo    |  0.3426  | 0.328367 |0.0889284 |0.0819758 |
+----------+----------+----------+----------+----------+----------+----------+
|    27    |   poly   |   ovr    |  0.3426  | 0.328367 |0.0889284 |0.0819758 |
+----------+----------+----------+----------+----------+----------+----------+
|    81    |  linear  |   ovo    |  0.8694  | 0.874917 | 0.743308 | 0.75361  |
+----------+----------+----------+----------+----------+----------+----------+
|    81    |  linear  |   ovr    |  0.8694  | 0.874917 | 0.743308 | 0.75361  |
+----------+----------+----------+----------+----------+----------+----------+
|    81    |   rbf    |   ovo    |  0.9518  | 0.955317 | 0.897281 | 0.904572 |
+----------+----------+----------+----------+----------+----------+----------+
|    81    |   rbf    |   ovr    |  0.9518  | 0.955317 | 0.897281 | 0.904572 |
+----------+----------+----------+----------+----------+----------+----------+
|    81    |   poly   |   ovo    |  0.8345  |  0.8349  | 0.690997 | 0.692687 |
+----------+----------+----------+----------+----------+----------+----------+
|    81    |   poly   |   ovr    |  0.8345  |  0.8349  | 0.690997 | 0.692687 |
+----------+----------+----------+----------+----------+----------+----------+
