SVM/documentation.html

<div id="outline-container-org6916c7a" class="outline-2">
<h2 id="org6916c7a"><span class="section-number-2">3.</span> Results</h2>
<div class="outline-text-2" id="text-3">
<p>
Actually there is not much to the results, they are exactly what we expect them to be, rbf better than poly and linear and the more iterations we have the higher the accuracy that we get! poly kernels are not as famous in SVMs as they are in natural language processing, even there they have their limitations, they are used in second order because they tend to over fit in higher orders!
</p>
<!-- This HTML table template is generated by emacs 27.2 -->
<table border="1">
  <tr>
    <td align="left" valign="top">
      &nbsp;max_iter&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;kernel&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;shape&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;TEST_P&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;TRAIN_P&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;TEST_RI&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;TRAIN_RI&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.4798&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.47685&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.221493&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.219144&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.4798&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.47685&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.221493&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.219144&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.3985&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.39905&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.161733&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.166375&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.3985&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.39905&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.161733&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.166375&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.2322&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.22295&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.0105866&nbsp;
    </td>
    <td align="left" valign="top">
      0.00974319
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;1&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.2322&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.22295&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      0.0105866&nbsp;
    </td>
    <td align="left" valign="top">
      0.00974319
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.5673&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.565733&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.301706&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.296545&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.5673&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.565733&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.301706&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.296545&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.5649&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.567817&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.300823&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.303718&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.5649&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.567817&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.300823&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.303718&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.1742&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.167583&nbsp;
    </td>
    <td align="left" valign="top">
      0.0114695&nbsp;
    </td>
    <td align="left" valign="top">
      0.0101923&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;3&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.1742&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.167583&nbsp;
    </td>
    <td align="left" valign="top">
      0.0114695&nbsp;
    </td>
    <td align="left" valign="top">
      0.0101923&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.6429&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.65365&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.407321&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.420937&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.6429&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.65365&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.407321&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.420937&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.7653&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.76735&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.568324&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.570437&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.7653&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.76735&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.568324&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.570437&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.2065&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.194183&nbsp;
    </td>
    <td align="left" valign="top">
      0.00901324
    </td>
    <td align="left" valign="top">
      0.00835075
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;9&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.2065&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.194183&nbsp;
    </td>
    <td align="left" valign="top">
      0.00901324
    </td>
    <td align="left" valign="top">
      0.00835075
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;27&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8028&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.803033&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.633213&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.632498&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;27&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8028&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.803033&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.633213&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.632498&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;27&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8877&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.886&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.77161&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.77001&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;27&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8877&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.886&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.77161&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.77001&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;27&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.3426&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.328367&nbsp;
    </td>
    <td align="left" valign="top">
      0.0889284&nbsp;
    </td>
    <td align="left" valign="top">
      0.0819758&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;27&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.3426&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.328367&nbsp;
    </td>
    <td align="left" valign="top">
      0.0889284&nbsp;
    </td>
    <td align="left" valign="top">
      0.0819758&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;81&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8694&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.874917&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.743308&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.75361&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;81&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;linear&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8694&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.874917&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.743308&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.75361&nbsp;&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;81&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.9518&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.955317&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.897281&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.904572&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;81&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;rbf&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.9518&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.955317&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.897281&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.904572&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;81&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovo&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8345&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8349&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.690997&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.692687&nbsp;
    </td>
  </tr>
  <tr>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;&nbsp;81&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;poly&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;&nbsp;ovr&nbsp;&nbsp;&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8345&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;&nbsp;0.8349&nbsp;&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.690997&nbsp;
    </td>
    <td align="left" valign="top">
      &nbsp;0.692687&nbsp;
    </td>
  </tr>
</table>
</div>
</div>
</div>
<div id="postamble" class="status">
<p class="author">Author: Tooraj Taraz</p>
<p class="date">Created: 2021-11-26 Fri 20:27</p>
</div>
</body>
</html>
